{"keras_version": "2.0.9", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 4096, 1], "name": "input_3"}, "name": "input_3"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_20", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 64, "padding": "same", "strides": [1], "kernel_size": [32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_20"}, {"inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "same", "name": "max_pooling1d_11"}, "name": "max_pooling1d_11"}, {"inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_21", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 128, "padding": "same", "strides": [1], "kernel_size": [16], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_21"}, {"inbound_nodes": [[["conv1d_21", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "same", "name": "max_pooling1d_12"}, "name": "max_pooling1d_12"}, {"inbound_nodes": [[["max_pooling1d_12", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_25", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 16, "padding": "same", "strides": [1], "kernel_size": [128], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_25"}, {"inbound_nodes": [[["conv1d_25", 0, 0, {}]]], "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_11", "size": 2, "trainable": true}, "name": "up_sampling1d_11"}, {"inbound_nodes": [[["up_sampling1d_11", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_26", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 8, "padding": "same", "strides": [1], "kernel_size": [256], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_26"}, {"inbound_nodes": [[["conv1d_26", 0, 0, {}]]], "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_12", "size": 2, "trainable": true}, "name": "up_sampling1d_12"}, {"inbound_nodes": [[["up_sampling1d_12", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_27", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 1, "padding": "same", "strides": [1], "kernel_size": [8], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_27"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv1d_27", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}