{"keras_version": "2.0.9", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 4096, 1], "name": "input_2"}, "name": "input_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_10", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 32, "padding": "same", "strides": [1], "kernel_size": [32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_10"}, {"inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "same", "name": "max_pooling1d_6"}, "name": "max_pooling1d_6"}, {"inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_11", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 64, "padding": "same", "strides": [1], "kernel_size": [16], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_11"}, {"inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "same", "name": "max_pooling1d_7"}, "name": "max_pooling1d_7"}, {"inbound_nodes": [[["max_pooling1d_7", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_14", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 16, "padding": "same", "strides": [1], "kernel_size": [62], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_14"}, {"inbound_nodes": [[["conv1d_14", 0, 0, {}]]], "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_6", "size": 2, "trainable": true}, "name": "up_sampling1d_6"}, {"inbound_nodes": [[["up_sampling1d_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_15", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 8, "padding": "same", "strides": [1], "kernel_size": [128], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_15"}, {"inbound_nodes": [[["conv1d_15", 0, 0, {}]]], "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_7", "size": 2, "trainable": true}, "name": "up_sampling1d_7"}, {"inbound_nodes": [[["up_sampling1d_7", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_16", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 1, "padding": "same", "strides": [1], "kernel_size": [8], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_16"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv1d_16", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}