{"keras_version": "2.0.9", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 4096, 1], "name": "input_4"}, "name": "input_4"}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_31", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 128, "padding": "same", "strides": [1], "kernel_size": [32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_31"}, {"inbound_nodes": [[["conv1d_31", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "same", "name": "max_pooling1d_16"}, "name": "max_pooling1d_16"}, {"inbound_nodes": [[["max_pooling1d_16", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_32", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 256, "padding": "same", "strides": [1], "kernel_size": [16], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_32"}, {"inbound_nodes": [[["conv1d_32", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "same", "name": "max_pooling1d_17"}, "name": "max_pooling1d_17"}, {"inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_36", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 32, "padding": "same", "strides": [1], "kernel_size": [128], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_36"}, {"inbound_nodes": [[["conv1d_36", 0, 0, {}]]], "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_16", "size": 2, "trainable": true}, "name": "up_sampling1d_16"}, {"inbound_nodes": [[["up_sampling1d_16", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_37", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 16, "padding": "same", "strides": [1], "kernel_size": [256], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_37"}, {"inbound_nodes": [[["conv1d_37", 0, 0, {}]]], "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_17", "size": 2, "trainable": true}, "name": "up_sampling1d_17"}, {"inbound_nodes": [[["up_sampling1d_17", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv1d_38", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1], "trainable": true, "filters": 1, "padding": "same", "strides": [1], "kernel_size": [16], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_constraint": null}, "name": "conv1d_38"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["conv1d_38", 0, 0]], "name": "model_4"}, "backend": "tensorflow"}